{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report listing two features related to adding a sanitized sticker asset and updating QuizSection to reference it correctly.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend component and asset in the project.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens, borders, and global background/foreground styles.",
  "frontend/index.html": "HTML entry point loading fonts, setting metadata, and mounting the React root element.",
  "frontend/src/App.tsx": "Top-level React app combining HeroSection, QuizSection, and ClosingSection with a global background and navigation.",
  "frontend/src/components/DedicationLayout.tsx": "Reusable layout wrapper that provides consistent container width and horizontal padding.",
  "frontend/src/components/quiz/CelebrationAnimation.tsx": "Full‑screen confetti, burst, and sparkle animation shown when triggered by quiz events.",
  "frontend/src/components/sections/ClosingSection.tsx": "Closing section showing the final message, signature, ornament, and footer with attribution.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section displaying title, subtitle, decorative elements, and a large photo with fallback behavior.",
  "frontend/src/components/sections/LetterSection.tsx": "Letter section rendering a heading and paragraphs from dedication content.",
  "frontend/src/components/sections/MomentsSection.tsx": "Grid of memory cards showing moments with titles, dates, and descriptions from content.",
  "frontend/src/components/sections/QuizSection.tsx": "React quiz component that manages questions, scoring, celebration effects, and renders either quiz questions or results.",
  "frontend/src/components/TopNav.tsx": "Sticky top navigation bar with scroll detection and smooth-scroll links to page sections.",
  "frontend/src/content/dedicationContent.ts": "Centralized content configuration defining hero text, quiz data, letter paragraphs, moments, and closing message for the site.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity handling, and status tracking using AuthClient.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light/dark themes and global layout behavior.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and responsive settings for the project.",
  "project_state.json": "Defines the project’s current build state, including required image assets, quiz behavior, layout rules, and known issues such as missing or incorrect image paths. Also lists existing features and architectural notes for the dedication website."
}