{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing two frontend-related features and associated metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Top-level component assembling Hero, Quiz, and Closing sections with navigation.",
  "frontend/src/components/DedicationLayout.tsx": "Layout wrapper providing consistent container width and padding.",
  "frontend/src/components/quiz/CelebrationAnimation.tsx": "Fullscreen confetti, burst, and sparkle animation shown on quiz success.",
  "frontend/src/components/sections/ClosingSection.tsx": "Closing section showing final message, signature, ornament, and footer attribution.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with background image, title, subtitle, hands illustration, and main cartoony hero photo.",
  "frontend/src/components/sections/LetterSection.tsx": "Letter section rendering the dedication heading and paragraphs.",
  "frontend/src/components/sections/MomentsSection.tsx": "Grid section displaying memorable moments with titles, dates, and descriptions.",
  "frontend/src/components/sections/QuizSection.tsx": "React quiz component managing question flow, scoring, and celebration animations.",
  "frontend/src/components/TopNav.tsx": "Sticky top navigation with smooth scrolling links and heart icon branding.",
  "frontend/src/content/dedicationContent.ts": "Centralized content config including hero text, quiz questions/results, letter text, and moments entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and auth lifecycle.",
  "frontend/src/index.css": "Tailwind base styles and custom color variables for light/dark themes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Defines the project’s build state, required hero image, architectural notes for quiz and assets, and lists existing features for a dedication website."
}