{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report describing implemented features, related components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for documentation or build reference.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, color tokens, and dark mode overrides.",
  "frontend/index.html": "HTML entry point loading fonts and the main React script with metadata for the dedication site.",
  "frontend/src/App.tsx": "Root component assembling TopNav, Hero, Quiz, and Closing sections into the page layout.",
  "frontend/src/components/DedicationLayout.tsx": "Container layout component providing consistent page padding and max width.",
  "frontend/src/components/quiz/CelebrationAnimation.tsx": "Full‑screen celebration overlay with confetti, burst, and sparkle animations triggered on quiz success.",
  "frontend/src/components/sections/ClosingSection.tsx": "Closing section displaying final message, signature, ornament, and footer attribution.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with background image, decorative elements, text content, and a large user photo with fallback.",
  "frontend/src/components/sections/LetterSection.tsx": "Letter section rendering dedication paragraphs using shared layout.",
  "frontend/src/components/sections/MomentsSection.tsx": "Moments grid displaying memory entries with titles, dates, and descriptions.",
  "frontend/src/components/sections/QuizSection.tsx": "Renders an interactive quiz with answer handling, scoring, celebration animation, and results display logic.",
  "frontend/src/components/TopNav.tsx": "Fixed navigation bar with smooth-scroll behavior and reactive background on scroll.",
  "frontend/src/content/dedicationContent.ts": "Stores static site content including hero text, quiz data, letter text, moments entries, and closing message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/index.css": "Defines Tailwind base styles and color variables for light and dark themes using OKLCH values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider setup.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugin usage for the project.",
  "project_state.json": "Contains project metadata, feature requirements, and notes for building a dedication website with a hero image and an interactive quiz. Also specifies required images, architectural notes, and existing implemented features."
}