{
  "backend/main.mo": "Motoko canister implementing user profiles, draft and live version management with access control, plus public message read/write methods.",
  "feature_evidence.json": "Metadata file listing implemented features, associated files, components, and test IDs for feature tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their roles in the app’s UI, logic, and styling.",
  "frontend/index.css": "Tailwind base/style definitions and custom CSS variables for light/dark themes.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React application root.",
  "frontend/scripts/promote-draft-21-to-live.ts": "Empty placeholder script file intended for promoting draft version 21.",
  "frontend/scripts/promote-draft-to-live.ts": "Node script that authenticates as admin and promotes a draft version to live using backend canister APIs.",
  "frontend/scripts/README.md": "Documentation for scripts that promote draft builds to live versions.",
  "frontend/src/App.tsx": "Root React component wiring navigation, sections, query client, notifications, and effects.",
  "frontend/src/components/DedicationLayout.tsx": "Simple layout wrapper applying consistent container width and padding.",
  "frontend/src/components/FallingHeart.tsx": "Component spawning animated falling icons and displaying a modal when images are clicked.",
  "frontend/src/components/PhotoModal.tsx": "Image modal with escape-close handling, body scroll lock, and error/loading states.",
  "frontend/src/components/quiz/CelebrationAnimation.tsx": "Displays confetti, burst, and sparkle animations when triggered.",
  "frontend/src/components/sections/ClosingSection.tsx": "Renders the closing message, decorative elements, and footer attribution.",
  "frontend/src/components/sections/GallerySection.tsx": "Empty placeholder file for a gallery section.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with background, dedication text, and a featured photo with error fallback.",
  "frontend/src/components/sections/LetterSection.tsx": "Shows a heading and multiple dedication paragraphs laid out in a centered column.",
  "frontend/src/components/sections/MomentsSection.tsx": "Displays a grid of memorable moments from content with titles, dates, and descriptions.",
  "frontend/src/components/sections/PublicLatestMessageSection.tsx": "Lets users submit a public message and shows the latest message with loading and validation states.",
  "frontend/src/components/sections/QuizSection.tsx": "Runs a multi-question quiz with scoring, transitions, and celebration animations.",
  "frontend/src/components/TopNav.tsx": "Sticky top navigation bar with smooth-scroll buttons to page sections.",
  "frontend/src/content/dedicationContent.ts": "Provides static content for a dedication site including hero text, quiz data, letter paragraphs, and memory entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useGallery.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication, managing identity load, login, and logout states.",
  "frontend/src/hooks/usePublicLatestMessage.ts": "Defines hooks to fetch and submit the latest public message using the actor API with react-query.",
  "frontend/src/hooks/useQueries.ts": "Provides a hook to fetch the current user's profile via the actor with react-query, handling actor-dependent loading states.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light/dark themes and global layout behavior.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, container settings, and animation keyframes.",
  "project_state.json": "Tracks project state for adding a public no-login message submission feature that stores and displays only the newest message. Includes architectural notes, existing features, and pending backend and frontend feature requests."
}