{
  "backend/main.mo": "Empty Motoko actor definition.",
  "feature_evidence.json": "Feature evidence report listing planned features, affected files, and component versions.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files and components.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark OKLCH color tokens and global styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Root React component composing Hero, Quiz, and Closing sections with navigation.",
  "frontend/src/components/DedicationLayout.tsx": "Reusable layout wrapper applying consistent container spacing.",
  "frontend/src/components/quiz/CelebrationAnimation.tsx": "Full‑screen confetti, burst, and sparkle animation overlay triggered by quiz events.",
  "frontend/src/components/sections/ClosingSection.tsx": "Closing section displaying final message, ornament, signature, and footer attribution.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with background image, dedication text, illustration, and primary photo with fallback.",
  "frontend/src/components/sections/LetterSection.tsx": "Letter section rendering dedication paragraphs using shared content config.",
  "frontend/src/components/sections/MomentsSection.tsx": "Grid‑based memories section showing titled moment cards with dates and descriptions.",
  "frontend/src/components/sections/QuizSection.tsx": "Implements an interactive quiz component with answer handling, celebration effects, score calculation, and result display.",
  "frontend/src/components/TopNav.tsx": "Sticky top navigation with scroll-based styling and smooth anchor navigation.",
  "frontend/src/content/dedicationContent.ts": "Provides centralized site content including hero text, quiz questions and results, a heartfelt letter, and moments entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity persistence through a React context.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with a warm color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react-query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugin integrations for the project.",
  "project_state.json": "Tracks project schema, version, goals, image requirements, architectural notes, and known issues for building a dedication website with a quiz and teddy-bear sticker."
}