{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing quiz section removal and layout updates with associated files and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for key frontend files including sections, layout, styling, and configuration.",
  "frontend/index.css": "Tailwind base setup defining OKLCH color variables for light and dark themes and global styling resets.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and mounting the React app.",
  "frontend/src/App.tsx": "Main React component composing navigation, hero, quiz, and closing sections.",
  "frontend/src/components/DedicationLayout.tsx": "Reusable layout wrapper enforcing consistent container width and padding.",
  "frontend/src/components/quiz/CelebrationAnimation.tsx": "Full-screen confetti, burst, and sparkle animation rendered when triggered.",
  "frontend/src/components/sections/ClosingSection.tsx": "Displays closing dedication message, ornament, footer, and attribution link.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, title, subtitle, hands illustration, and large photo with fallback handling.",
  "frontend/src/components/sections/LetterSection.tsx": "Renders dedication letter heading and paragraphs in a centered layout.",
  "frontend/src/components/sections/MomentsSection.tsx": "Grid of memory cards with titles, dates, and descriptions styled with sparkle icons.",
  "frontend/src/components/sections/QuizSection.tsx": "Renders an interactive quiz with stateful navigation, scoring, celebrations, and a results screen. Manages question flow, correct-answer animations, and quiz reset.",
  "frontend/src/components/TopNav.tsx": "Sticky navigation bar with scroll detection and smooth scrolling to sections.",
  "frontend/src/content/dedicationContent.ts": "Provides all static site content including hero text, quiz questions and results, letter paragraphs, and moments entries.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor based on Internet Identity, invalidating related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling auth client setup, login state, stored identity loading, and logout.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom light/dark color variables, applying global typography and layout settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider, applying global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugin integrations.",
  "project_state.json": "JSON state describing the project’s requirements, current issues, and architectural notes for building a personal dedication site with a hero image and quiz. Includes known image-loading problems, feature definitions, and indicates this is a fix request."
}