{
  "kind": "build_request",
  "title": "Replace hero image with a more cartoony cute illustration",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Add a new more cartoony cute hero image as a static asset under `frontend/public/assets/generated/` and ensure it can be loaded directly via `/assets/generated/...` without relying on the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "try a different one more cartoony"
        ]
      },
      "acceptanceCriteria": [
        "A new cartoony hero image file exists in `frontend/public/assets/generated/` with the exact filename specified in this build request.",
        "The image is accessible at runtime via an `<img src=\"/assets/generated/...\">` URL and loads successfully in the browser network tab (no 404)."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Update `frontend/src/components/sections/HeroSection.tsx` to use the new cartoony hero image filename in the main hero photo `<img>` (currently `src=\"/assets/generated/cute-hero-photo.dim_1600x2000.jpg\"`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "try a different one more cartoony"
        ]
      },
      "acceptanceCriteria": [
        "`HeroSection` references the new cartoony image path in its main photo `src`.",
        "On page load, the hero section displays the new cartoony image and does not fall back to the \"Photo coming soon\" placeholder when the asset exists."
      ]
    }
  ],
  "constraints": [
    "Do not serve images via the backend; all images must be static assets in `frontend/public/assets/generated/`.",
    "Keep the existing hero image fallback behavior (show the placeholder only when the hero image fails to load).",
    "Do not modify files under `frontend/src/components/ui` or the immutable hook entrypoints listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Changing quiz behavior, questions, scoring, or celebration animations.",
    "Changing site navigation structure or section order."
  ],
  "imageRequirements": {
    "required": [
      "Cartoony cute character-style hero portrait illustration with warm pastel colors and simple shapes (cute-hero-photo-cartoony.dim_1600x2000.jpg)"
    ],
    "edits": []
  }
}