{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Swap quiz corner sticker to teddy bear sticker",
  "requirements": [
    {
      "id": "REQ-50",
      "summary": "Add a new teddy-bear cartoon sticker image as a static asset under frontend/public/assets/generated/ with a sanitized filename and ensure it is loadable as a public static asset.",
      "acceptanceCriteria": [
        "A new teddy bear cartoon sticker image file exists under `frontend/public/assets/generated/` with a sanitized filename.",
        "Requesting `GET /assets/generated/<sanitized-filename>` in the browser loads the image (no 404)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/teddy-bear-sticker.dim_220x220.png",
          "operation": "create",
          "description": "Add the generated static teddy bear sticker image asset (transparent background) at this exact path so it is publicly served by the frontend static file server."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Replace the existing quiz corner sticker image source with the new teddy bear sticker in both the question and results card views while preserving layout and preventing overlay from blocking content.",
      "acceptanceCriteria": [
        "In `QuizSection.tsx`, both sticker `<img>` instances (question card and results card) use the exact same new teddy-bear sticker `/assets/generated/...` path.",
        "The sticker renders visibly on the quiz question card and on the quiz results card.",
        "The sticker overlay does not cover the question text or answer buttons at common breakpoints (mobile and desktop)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/QuizSection.tsx",
          "operation": "modify",
          "description": "Update both corner-sticker <img> src values (question and results card) from `/assets/generated/kawaii-valentines-stickers.dim_220x220.png` to `/assets/generated/teddy-bear-sticker.dim_220x220.png`, keeping existing positioning/sizing/rotation classes and ensuring the sticker remains pointer-events-none so it cannot block text or buttons."
        }
      ]
    }
  ]
}